results/springboot/c6gn.xlarge/wrk2.log
===== Spring Boot Benchmark (wrk) =====
Instance Type: c6gn.xlarge
Spring Boot Host: springboot-server-c6gn-xlarge

--- Warm-up Phase (30s) ---
Warm-up complete

--- Main Page - 2 threads, 50 connections, 60s ---
Running 1m test @ http://springboot-server-c6gn-xlarge:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.98ms    1.06ms  42.99ms   91.86%
    Req/Sec    13.05k   669.61    14.97k    71.58%
  Latency Distribution
     50%    1.84ms
     75%    2.08ms
     90%    2.73ms
     99%    5.73ms
  1558646 requests in 1.00m, 208.38MB read
Requests/sec:  25975.52
Transfer/sec:      3.47MB

--- Main Page - 2 threads, 100 connections, 60s ---
Running 1m test @ http://springboot-server-c6gn-xlarge:8080/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.55ms    1.29ms  48.42ms   80.20%
    Req/Sec    14.21k   779.31    16.96k    67.53%
  Latency Distribution
     50%    3.44ms
     75%    3.97ms
     90%    4.93ms
     99%    7.22ms
  1693729 requests in 1.00m, 226.44MB read
Requests/sec:  28226.23
Transfer/sec:      3.77MB

--- High Load - 2 threads, 200 connections, 30s ---
Running 30s test @ http://springboot-server-c6gn-xlarge:8080/
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.59ms    2.18ms  77.23ms   78.56%
    Req/Sec    15.31k   812.61    17.20k    71.57%
  Latency Distribution
     50%    6.39ms
     75%    7.48ms
     90%    8.96ms
     99%   12.59ms
  910827 requests in 30.04s, 121.77MB read
Requests/sec:  30318.70
Transfer/sec:      4.05MB

===== Spring Boot Benchmark Complete =====